In [2]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split,cross_val_score
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score
from sklearn.compose import ColumnTransformer

In [3]:
df = pd.read_csv(r'F:\ML\100 days ml\data\train.csv')[['Age','Fare','SibSp','Parch','Survived']]

In [4]:
df

      Age     Fare  SibSp  Parch  Survived
0    22.0   7.2500      1      0         0
1    38.0  71.2833      1      0         1
2    26.0   7.9250      0      0         1
3    35.0  53.1000      1      0         1
4    35.0   8.0500      0      0         0
..    ...      ...    ...    ...       ...
886  27.0  13.0000      0      0         0
887  19.0  30.0000      0      0         1
888   NaN  23.4500      1      2         0
889  26.0  30.0000      0      0         1
890  32.0   7.7500      0      0         0

[891 rows x 5 columns]

In [5]:
df.isnull().sum()

Age         177
Fare          0
SibSp         0
Parch         0
Survived      0
dtype: int64

In [6]:
df.dropna(inplace=True)

In [7]:
df['family'] = df['SibSp'] + df['Parch']

In [8]:
df.drop(columns=['SibSp','Parch'],inplace=True)

In [9]:
x = df.drop(columns=['Survived'])
y = df['Survived']

In [10]:
x

      Age     Fare  family
0    22.0   7.2500       1
1    38.0  71.2833       1
2    26.0   7.9250       0
3    35.0  53.1000       1
4    35.0   8.0500       0
..    ...      ...     ...
885  39.0  29.1250       5
886  27.0  13.0000       0
887  19.0  30.0000       0
889  26.0  30.0000       0
890  32.0   7.7500       0

[714 rows x 3 columns]

In [11]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [12]:
clf = DecisionTreeClassifier()

clf.fit(x_train,y_train)

y_pred = clf.predict(x_test)

accuracy_score(y_test,y_pred)

0.6223776223776224

In [13]:
np.mean(cross_val_score(DecisionTreeClassifier(),x,y,cv=10,scoring="accuracy"))

0.6527190923317685

In [14]:
from sklearn.preprocessing import Binarizer

In [15]:
trf=ColumnTransformer([
    ("bin",Binarizer(copy=False),["family"])
],remainder="passthrough")

In [16]:
x_train,x_test

(      Age      Fare  family
 328  31.0   20.5250       2
 73   26.0   14.4542       1
 253  30.0   16.1000       1
 719  33.0    7.7750       0
 666  25.0   13.0000       0
 ..    ...       ...     ...
 92   46.0   61.1750       1
 134  25.0   13.0000       0
 337  41.0  134.5000       0
 548  33.0   20.5250       2
 130  33.0    7.8958       0

 [571 rows x 3 columns],
       Age     Fare  family
 149  42.0  13.0000       0
 407   3.0  18.7500       2
 53   29.0  26.0000       1
 369  24.0  69.3000       0
 818  43.0   6.4500       0
 ..    ...      ...     ...
 819  10.0  27.9000       5
 164   1.0  39.6875       5
 363  35.0   7.0500       0
 56   21.0  10.5000       0
 136  19.0  26.2833       2

 [143 rows x 3 columns])

In [17]:
x_train_trf = trf.fit_transform(x_train)
x_test_trf = trf.transform(x_test)

In [18]:
pd.DataFrame(x_train_trf,columns=['family','Age','Fare'])

     family   Age      Fare
0       1.0  31.0   20.5250
1       1.0  26.0   14.4542
2       1.0  30.0   16.1000
3       0.0  33.0    7.7750
4       0.0  25.0   13.0000
..      ...   ...       ...
566     1.0  46.0   61.1750
567     0.0  25.0   13.0000
568     0.0  41.0  134.5000
569     1.0  33.0   20.5250
570     0.0  33.0    7.8958

[571 rows x 3 columns]

In [20]:
clf = DecisionTreeClassifier()
clf.fit(x_train_trf,y_train)
y_pred2 = clf.predict(x_test_trf)

accuracy_score(y_test,y_pred2)

0.6013986013986014

In [21]:
x_trf = trf.fit_transform(x)
np.mean(cross_val_score(DecisionTreeClassifier(),x_trf,y,cv=10,scoring='accuracy'))

0.6332355242566511